
## Plan Result (koyashiro.net)

[CI link](https://github.com/koyashiro/infra/actions/runs/8821827230)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_web_analytics_site.koyashiro_net
* Update
  * cloudflare_pages_project.koyashiro_net


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_pages_project.koyashiro_net will be updated in-place
  ~ resource "cloudflare_pages_project" "koyashiro_net" {
        id                = "koyashiro-net"
        name              = "koyashiro-net"
        # (5 unchanged attributes hidden)

      ~ build_config {
          + web_analytics_tag   = (known after apply)
          + web_analytics_token = (sensitive value)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # cloudflare_web_analytics_site.koyashiro_net will be created
  + resource "cloudflare_web_analytics_site" "koyashiro_net" {
      + account_id   = (sensitive value)
      + auto_install = true
      + id           = (known after apply)
      + ruleset_id   = (known after apply)
      + site_tag     = (known after apply)
      + site_token   = (sensitive value)
      + snippet      = (sensitive value)
      + zone_tag     = (sensitive value)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":189,"Program":"tfcmt","SHA1":"111416dde9b6824c299cc7fa2984f7b31889ce3f","Target":"koyashiro.net","Vars":{},"WorkflowName":"terraform"} -->